/*
  Необходимо для заданной строки выполнить следующие задачи.
  
  1. Привести строку к написанию с заглавной буквы, т.е. для ввода "kolbasa" результат: "Kolbasa". Результат вывести на экран.
  2. Изменить строку таким образом, чтобы все буквы в ней были заглавными, т.е. для ввода "kolbasa" результат: "KOLBASA". Результат вывести на экран.
  3. Изменить строку таким образом, чтобы все буквы в ней были прописными, т.е. для ввода "KOLBASA" результат: "kolbasa". Результат вывести на экран.

  Пример ввода: HeLLo
  Пример вывода: Hello HELLO hello
*/

#include <assert.h>
#include <stdio.h>

int main()
{
    char str[20] = {0};

    scanf("%i%s", &counter, str);

    // решение здесь
}
